{
  "backend/main.mo": "Backend canister handling auth, user profiles, shareable draft links, draft comments, and invite code generation with access control.",
  "feature_evidence.json": "Aggregated feature evidence report mapping features to implementation files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including routing pages, utilities, and styling assets.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme color variables, dark mode, and base layout styling.",
  "frontend/index.html": "Base HTML document loading fonts, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "Main React router setup defining app layout, navigation, and all route components for drafts, learning, portfolio, skills, settings, and shared drafts.",
  "frontend/src/components/AppHeader.tsx": "Header component showing app title, user level/XP, and navigation buttons for major sections.",
  "frontend/src/components/challenge/WeeklyChallengeCard.tsx": "Renders the weekly challenge card with status, description, and navigation to the challenge page.",
  "frontend/src/components/DraftTypeSelector.tsx": "Component rendering draft-type cards grouped by phase with mastery status, stats, and navigation into learning flow.",
  "frontend/src/components/ProgressSummary.tsx": "Displays user progress with levels, XP, mastered draft counts, and average scores using offline state.",
  "frontend/src/data/draftTypes.ts": "Defines draft type metadata, phases, and helper retrieval functions.",
  "frontend/src/data/legalNotice.ts": "Provides the anatomy, model notice, and annotations for legal notices.",
  "frontend/src/data/scenariosBank.ts": "Stores predefined drafting scenarios with metadata and lookup helpers.",
  "frontend/src/feedback/feedbackEngine.ts": "Analyzes drafts to generate scores and feedback items based on content rules.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on user identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, logout, and identity management.",
  "frontend/src/index.css": "Configures Tailwind layers, defines light/dark CSS variables, global typography, and print-specific styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders App.",
  "frontend/src/pages/challenge/WeeklyChallengePage.tsx": "Displays the weekly challenge scenario, reward info, completion state, and starts a new challenge attempt.",
  "frontend/src/pages/DraftPage.tsx": "Displays draft practice overview with progress, weekly challenge, and draft type selector.",
  "frontend/src/pages/draftType/CompareImprovePage.tsx": "Shows the latest scored draft, model draft, and categorized feedback for comparison and improvement.",
  "frontend/src/pages/draftType/DraftTypeLayout.tsx": "Provides the layout and navigation tabs for a draft type, routing to structure, wizard, practice, and compare pages.",
  "frontend/src/pages/draftType/EditorPage.tsx": "Loads and edits a draft attempt with autosave, scenario display, and submission for feedback scoring.",
  "frontend/src/pages/draftType/FreePracticePage.tsx": "Lists scenarios by draft type and creates new draft attempts for free‑practice drafting.",
  "frontend/src/pages/draftType/GuidedWizardPage.tsx": "Presents a question‑based wizard to auto‑generate a legal notice draft and save it as an attempt.",
  "frontend/src/pages/draftType/StructureTutorialPage.tsx": "Shows the structure and annotated model notice for legal notices using an accordion tutorial.",
  "frontend/src/pages/learn/BeforeAfterGalleryPage.tsx": "Displays example draft improvements with before/after text and listed enhancements using UI cards.",
  "frontend/src/pages/learn/ChecklistPage.tsx": "Shows drafting checklists per draft type, rendering items with checkboxes based on URL params.",
  "frontend/src/pages/learn/ClauseLibraryPage.tsx": "Provides searchable standard clauses with copy-to-clipboard functionality and category tags.",
  "frontend/src/pages/learn/CommonMistakesPage.tsx": "Lists common drafting mistakes for a draft type using an accordion with explanations and examples.",
  "frontend/src/pages/learn/TemplatesPage.tsx": "Renders downloadable blank templates for each draft type in TXT or printable PDF format.",
  "frontend/src/pages/LearnPage.tsx": "Renders a grid of learning resources linking to mistakes, checklists, templates, clauses, and gallery pages.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows grouped draft portfolio with scores, navigation to drafts, and export functionality.",
  "frontend/src/pages/PrintPreviewPage.tsx": "Loads a draft attempt and provides a formatted print preview with print action and metadata display.",
  "frontend/src/pages/SettingsPage.tsx": "Provides settings for practice and online features plus data export, import, and reset tools.",
  "frontend/src/pages/SharedDraftPage.tsx": "Fetches and displays a shared draft with commenting functionality using an actor API.",
  "frontend/src/pages/SkillsPage.tsx": "Displays overall proficiency, individual skill scores, and recent drafts using progress indicators.",
  "frontend/src/storage/localStore.ts": "Manages persisted app state in localStorage, including initialization, migration, and draft/XP updates.",
  "frontend/src/storage/types.ts": "Defines TypeScript types for drafts, scores, achievements, settings, and overall storage state.",
  "frontend/src/storage/useOfflineState.ts": "React hook that syncs component state with localStorage and exposes methods to manage draft attempts.",
  "frontend/src/utils/exporters.ts": "Provides functions to export single or multiple draft attempts as text or printable PDF using new windows and styled HTML.",
  "frontend/src/utils/mastery.ts": "Computes draft mastery status based on attempt scores and calculates an overall proficiency score from skill metrics.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL parameters and sessionStorage-backed state for routing and tokens.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the app’s design system.",
  "project_state.json": "Describes the project’s state, goals, features, requirements, and design guidelines for the Draft Master application."
}